{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "01": 2,
      "001": 3,
      "11": 4,
      "0001": 5,
      "101": 6,
      "00": 7,
      "0101": 8,
      "1001": 9,
      "00001": 10,
      "10001": 11,
      "0111": 12,
      "01001": 13,
      "01101": 14,
      "000001": 15,
      "00111": 16,
      "100001": 17,
      "000111": 18,
      "011001": 19,
      "001001": 20,
      "10111": 21,
      "0000": 22,
      "10": 23,
      "010001": 24,
      "0000111": 25,
      "100111": 26,
      "1000111": 27,
      "100": 28,
      "101001": 29,
      "010111": 30,
      "1000001": 31,
      "0101101": 32,
      "1011001": 33,
      "0110001": 34,
      "01010101": 35,
      "0111001": 36,
      "0101001": 37,
      "1010001": 38,
      "0100111": 39,
      "1111": 40,
      "011": 41,
      "0011001": 42,
      "000": 43,
      "0100001": 44,
      "101101": 45,
      "0000001": 46,
      "01110001": 47,
      "00111001": 48,
      "01101101": 49,
      "0001101": 50,
      "10000": 51,
      "0001001": 52,
      "11001": 53,
      "00000111": 54,
      "011111": 55,
      "1000": 56,
      "01001101": 57,
      "01000111": 58,
      "01101001": 59,
      "01011001": 60,
      "01100001": 61,
      "001101": 62,
      "0110111": 63,
      "100011001": 64,
      "01001001": 65,
      "01010001": 66,
      "1001001": 67,
      "10000111": 68,
      "10001101": 69,
      "010101": 70,
      "0011111": 71,
      "10011001": 72,
      "10000001": 73,
      "010101101": 74,
      "01000001": 75,
      "1011110": 76,
      "0111101": 77,
      "100011110": 78,
      "000011111": 79,
      "1000000": 80,
      "100111001": 81,
      "011100110": 82,
      "011000001": 83,
      "00011001": 84,
      "00000001": 85,
      "011011001": 86,
      "010011001": 87,
      "00010111": 88,
      "00001101": 89,
      "00011111": 90,
      "10001001": 91,
      "100001001": 92,
      "1001101": 93,
      "10111001": 94,
      "00111101": 95,
      "011001001": 96,
      "01100111": 97,
      "000000": 98,
      "00001001": 99
    },
    "merges": [
      [
        "0",
        "1"
      ],
      [
        "0",
        "01"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "001"
      ],
      [
        "1",
        "01"
      ],
      [
        "0",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "001"
      ],
      [
        "0",
        "0001"
      ],
      [
        "1",
        "0001"
      ],
      [
        "01",
        "11"
      ],
      [
        "01",
        "001"
      ],
      [
        "01",
        "101"
      ],
      [
        "00",
        "0001"
      ],
      [
        "001",
        "11"
      ],
      [
        "1",
        "00001"
      ],
      [
        "0001",
        "11"
      ],
      [
        "01",
        "1001"
      ],
      [
        "001",
        "001"
      ],
      [
        "101",
        "11"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "0"
      ],
      [
        "01",
        "0001"
      ],
      [
        "00001",
        "11"
      ],
      [
        "1001",
        "11"
      ],
      [
        "10001",
        "11"
      ],
      [
        "1",
        "00"
      ],
      [
        "101",
        "001"
      ],
      [
        "0101",
        "11"
      ],
      [
        "1",
        "000001"
      ],
      [
        "0101",
        "101"
      ],
      [
        "101",
        "1001"
      ],
      [
        "01",
        "10001"
      ],
      [
        "0101",
        "0101"
      ],
      [
        "0111",
        "001"
      ],
      [
        "0101",
        "001"
      ],
      [
        "101",
        "0001"
      ],
      [
        "01001",
        "11"
      ],
      [
        "11",
        "11"
      ],
      [
        "01",
        "1"
      ],
      [
        "001",
        "1001"
      ],
      [
        "00",
        "0"
      ],
      [
        "01",
        "00001"
      ],
      [
        "101",
        "101"
      ],
      [
        "00",
        "00001"
      ],
      [
        "0111",
        "0001"
      ],
      [
        "00111",
        "001"
      ],
      [
        "01101",
        "101"
      ],
      [
        "0001",
        "101"
      ],
      [
        "1",
        "0000"
      ],
      [
        "0001",
        "001"
      ],
      [
        "11",
        "001"
      ],
      [
        "000001",
        "11"
      ],
      [
        "0111",
        "11"
      ],
      [
        "100",
        "0"
      ],
      [
        "01001",
        "101"
      ],
      [
        "01",
        "000111"
      ],
      [
        "01101",
        "001"
      ],
      [
        "0101",
        "1001"
      ],
      [
        "01",
        "100001"
      ],
      [
        "001",
        "101"
      ],
      [
        "01101",
        "11"
      ],
      [
        "10001",
        "1001"
      ],
      [
        "01001",
        "001"
      ],
      [
        "0101",
        "0001"
      ],
      [
        "1001",
        "001"
      ],
      [
        "100001",
        "11"
      ],
      [
        "10001",
        "101"
      ],
      [
        "0101",
        "01"
      ],
      [
        "00111",
        "11"
      ],
      [
        "1001",
        "1001"
      ],
      [
        "100",
        "00001"
      ],
      [
        "0101",
        "01101"
      ],
      [
        "01",
        "000001"
      ],
      [
        "10111",
        "10"
      ],
      [
        "0111",
        "101"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "0000111",
        "11"
      ],
      [
        "10000",
        "00"
      ],
      [
        "100111",
        "001"
      ],
      [
        "0111001",
        "10"
      ],
      [
        "01",
        "1000001"
      ],
      [
        "0001",
        "1001"
      ],
      [
        "00",
        "000001"
      ],
      [
        "01101",
        "1001"
      ],
      [
        "01001",
        "1001"
      ],
      [
        "0001",
        "0111"
      ],
      [
        "00001",
        "101"
      ],
      [
        "000111",
        "11"
      ],
      [
        "10001",
        "001"
      ],
      [
        "100001",
        "001"
      ],
      [
        "1001",
        "101"
      ],
      [
        "10111",
        "001"
      ],
      [
        "00111",
        "101"
      ],
      [
        "011001",
        "001"
      ],
      [
        "011001",
        "11"
      ],
      [
        "0000",
        "00"
      ],
      [
        "00001",
        "001"
      ]
    ]
  }
}