{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "01": 2,
      "001": 3,
      "11": 4,
      "0001": 5,
      "101": 6,
      "00": 7,
      "0101": 8,
      "1001": 9,
      "00001": 10,
      "10001": 11,
      "0111": 12,
      "01001": 13,
      "01101": 14,
      "000001": 15,
      "11001": 16,
      "111": 17,
      "010001": 18,
      "001001": 19,
      "011001": 20,
      "100001": 21,
      "0000": 22,
      "110001": 23,
      "101001": 24,
      "011": 25,
      "1111": 26,
      "0000001": 27,
      "1011001": 28,
      "000": 29,
      "11101": 30,
      "0101101": 31,
      "01010101": 32,
      "0110001": 33,
      "1110001": 34,
      "0111001": 35,
      "10": 36,
      "0101001": 37,
      "111001": 38,
      "1100001": 39,
      "0100001": 40,
      "1010001": 41,
      "0011001": 42,
      "1110": 43,
      "01110001": 44,
      "110101": 45,
      "101101": 46,
      "1101001": 47,
      "1000001": 48,
      "001101": 49,
      "00000001": 50,
      "110111": 51,
      "01101101": 52,
      "01001101": 53,
      "00111001": 54,
      "11010001": 55,
      "0001101": 56,
      "10011001": 57,
      "11100001": 58,
      "01100001": 59,
      "01101001": 60,
      "0010101": 61,
      "100011001": 62,
      "10001101": 63,
      "01011001": 64,
      "0001001": 65,
      "000000": 66,
      "11111": 67,
      "11000001": 68,
      "01000001": 69,
      "00001101": 70,
      "1101101": 71,
      "11000": 72,
      "011011001": 73,
      "01111001": 74,
      "110011": 75,
      "1001101": 76,
      "11011001": 77,
      "1001001": 78,
      "000000001": 79,
      "01110101": 80,
      "111000001": 81,
      "0111101": 82,
      "010101101": 83,
      "01001001": 84,
      "011100110": 85,
      "110100001": 86,
      "11011": 87,
      "0010001": 88,
      "1111001": 89,
      "010010101": 90,
      "1100": 91,
      "101001001": 92,
      "00011001": 93,
      "00001001": 94,
      "10001001": 95,
      "10000001": 96,
      "011010101": 97,
      "010001101": 98,
      "110": 99
    },
    "merges": [
      [
        "0",
        "1"
      ],
      [
        "0",
        "01"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "001"
      ],
      [
        "1",
        "01"
      ],
      [
        "0",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "001"
      ],
      [
        "0",
        "0001"
      ],
      [
        "1",
        "0001"
      ],
      [
        "01",
        "11"
      ],
      [
        "01",
        "001"
      ],
      [
        "01",
        "101"
      ],
      [
        "00",
        "0001"
      ],
      [
        "11",
        "001"
      ],
      [
        "11",
        "1"
      ],
      [
        "01",
        "0001"
      ],
      [
        "001",
        "001"
      ],
      [
        "01",
        "1001"
      ],
      [
        "1",
        "00001"
      ],
      [
        "00",
        "00"
      ],
      [
        "11",
        "0001"
      ],
      [
        "101",
        "001"
      ],
      [
        "01",
        "1"
      ],
      [
        "11",
        "11"
      ],
      [
        "00",
        "00001"
      ],
      [
        "101",
        "1001"
      ],
      [
        "00",
        "0"
      ],
      [
        "11",
        "101"
      ],
      [
        "0101",
        "101"
      ],
      [
        "0101",
        "0101"
      ],
      [
        "01",
        "10001"
      ],
      [
        "11",
        "10001"
      ],
      [
        "0111",
        "001"
      ],
      [
        "1",
        "0"
      ],
      [
        "0101",
        "001"
      ],
      [
        "11",
        "1001"
      ],
      [
        "11",
        "00001"
      ],
      [
        "01",
        "00001"
      ],
      [
        "101",
        "0001"
      ],
      [
        "001",
        "1001"
      ],
      [
        "111",
        "0"
      ],
      [
        "0111",
        "0001"
      ],
      [
        "11",
        "0101"
      ],
      [
        "101",
        "101"
      ],
      [
        "11",
        "01001"
      ],
      [
        "1",
        "000001"
      ],
      [
        "001",
        "101"
      ],
      [
        "00",
        "000001"
      ],
      [
        "11",
        "0111"
      ],
      [
        "01101",
        "101"
      ],
      [
        "01001",
        "101"
      ],
      [
        "001",
        "11001"
      ],
      [
        "11",
        "010001"
      ],
      [
        "0001",
        "101"
      ],
      [
        "1001",
        "1001"
      ],
      [
        "111",
        "00001"
      ],
      [
        "01",
        "100001"
      ],
      [
        "01101",
        "001"
      ],
      [
        "001",
        "0101"
      ],
      [
        "10001",
        "1001"
      ],
      [
        "10001",
        "101"
      ],
      [
        "0101",
        "1001"
      ],
      [
        "0001",
        "001"
      ],
      [
        "0000",
        "00"
      ],
      [
        "11",
        "111"
      ],
      [
        "11",
        "000001"
      ],
      [
        "01",
        "000001"
      ],
      [
        "00001",
        "101"
      ],
      [
        "11",
        "01101"
      ],
      [
        "11",
        "000"
      ],
      [
        "01101",
        "1001"
      ],
      [
        "0111",
        "1001"
      ],
      [
        "11001",
        "1"
      ],
      [
        "1001",
        "101"
      ],
      [
        "11",
        "011001"
      ],
      [
        "1001",
        "001"
      ],
      [
        "0000",
        "00001"
      ],
      [
        "0111",
        "0101"
      ],
      [
        "111",
        "000001"
      ],
      [
        "0111",
        "101"
      ],
      [
        "0101",
        "01101"
      ],
      [
        "01001",
        "001"
      ],
      [
        "0111001",
        "10"
      ],
      [
        "11",
        "0100001"
      ],
      [
        "11",
        "011"
      ],
      [
        "001",
        "0001"
      ],
      [
        "11",
        "11001"
      ],
      [
        "01001",
        "0101"
      ],
      [
        "11",
        "00"
      ],
      [
        "101",
        "001001"
      ],
      [
        "0001",
        "1001"
      ],
      [
        "00001",
        "001"
      ],
      [
        "10001",
        "001"
      ],
      [
        "1",
        "0000001"
      ],
      [
        "01101",
        "0101"
      ],
      [
        "010001",
        "101"
      ],
      [
        "11",
        "0"
      ]
    ]
  }
}