{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "10": 2,
      "100": 3,
      "11": 4,
      "1000": 5,
      "110": 6,
      "00": 7,
      "1010": 8,
      "11000": 9,
      "1100": 10,
      "1011": 11,
      "10100": 12,
      "10000": 13,
      "10110": 14,
      "10011": 15,
      "100000": 16,
      "100110": 17,
      "100011": 18,
      "110000": 19,
      "1100000": 20,
      "101100": 21,
      "11011": 22,
      "101000": 23,
      "110011": 24,
      "100100": 25,
      "1100011": 26,
      "011": 27,
      "1000011": 28,
      "1010110": 29,
      "101011": 30,
      "10101010": 31,
      "1011000": 32,
      "110110": 33,
      "1010011": 34,
      "1001011": 35,
      "1001100": 36,
      "000": 37,
      "1000110": 38,
      "1001010": 39,
      "10001011": 40,
      "0011": 41,
      "1100110": 42,
      "1000000": 43,
      "1010000": 44,
      "10010110": 45,
      "10100110": 46,
      "1111": 47,
      "101": 48,
      "1001000": 49,
      "10100011": 50,
      "10110000": 51,
      "11000000": 52,
      "10100000": 53,
      "10010100": 54,
      "00011": 55,
      "10110110": 56,
      "11000110": 57,
      "100100110": 58,
      "1011011": 59,
      "11011110": 60,
      "1101000": 61,
      "0000": 62,
      "1001110011": 63,
      "10101100": 64,
      "11100000": 65,
      "111000": 66,
      "10011000": 67,
      "10010011": 68,
      "1111000": 69,
      "101100000": 70,
      "11001100": 71,
      "10101000": 72,
      "101010110": 73,
      "11000011": 74,
      "1100011110": 75,
      "0110": 76,
      "100101100": 77,
      "10010000": 78,
      "1011110": 79,
      "1110000": 80,
      "101001010": 81,
      "10111000": 82,
      "10000011": 83,
      "110000000": 84,
      "110001100": 85,
      "11000111000": 86,
      "10101101": 87,
      "100101000": 88,
      "10110011": 89,
      "101101101": 90,
      "1011100110": 91,
      "110000011": 92,
      "10011110": 93,
      "110010110": 94,
      "10000110": 95,
      "11001000": 96,
      "1001111": 97,
      "1010101": 98,
      "100100000": 99
    },
    "merges": [
      [
        "1",
        "0"
      ],
      [
        "10",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "10"
      ],
      [
        "0",
        "0"
      ],
      [
        "10",
        "10"
      ],
      [
        "1",
        "1000"
      ],
      [
        "1",
        "100"
      ],
      [
        "10",
        "11"
      ],
      [
        "10",
        "100"
      ],
      [
        "1000",
        "0"
      ],
      [
        "10",
        "110"
      ],
      [
        "100",
        "11"
      ],
      [
        "1000",
        "00"
      ],
      [
        "100",
        "110"
      ],
      [
        "1000",
        "11"
      ],
      [
        "11000",
        "0"
      ],
      [
        "11000",
        "00"
      ],
      [
        "10",
        "1100"
      ],
      [
        "110",
        "11"
      ],
      [
        "10",
        "1000"
      ],
      [
        "1100",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "11000",
        "11"
      ],
      [
        "0",
        "11"
      ],
      [
        "10000",
        "11"
      ],
      [
        "1010",
        "110"
      ],
      [
        "1010",
        "11"
      ],
      [
        "1010",
        "1010"
      ],
      [
        "10",
        "11000"
      ],
      [
        "110",
        "110"
      ],
      [
        "10100",
        "11"
      ],
      [
        "100",
        "1011"
      ],
      [
        "100",
        "1100"
      ],
      [
        "00",
        "0"
      ],
      [
        "1000",
        "110"
      ],
      [
        "100",
        "1010"
      ],
      [
        "1000",
        "1011"
      ],
      [
        "00",
        "11"
      ],
      [
        "1100",
        "110"
      ],
      [
        "100000",
        "0"
      ],
      [
        "10",
        "10000"
      ],
      [
        "100",
        "10110"
      ],
      [
        "10100",
        "110"
      ],
      [
        "11",
        "11"
      ],
      [
        "10",
        "1"
      ],
      [
        "100",
        "1000"
      ],
      [
        "10",
        "100011"
      ],
      [
        "10",
        "110000"
      ],
      [
        "1100000",
        "0"
      ],
      [
        "10",
        "100000"
      ],
      [
        "100",
        "10100"
      ],
      [
        "00",
        "011"
      ],
      [
        "10110",
        "110"
      ],
      [
        "11000",
        "110"
      ],
      [
        "100",
        "100110"
      ],
      [
        "10110",
        "11"
      ],
      [
        "11011",
        "110"
      ],
      [
        "110",
        "1000"
      ],
      [
        "00",
        "00"
      ],
      [
        "10011",
        "10011"
      ],
      [
        "1010",
        "1100"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "1000"
      ],
      [
        "100",
        "11000"
      ],
      [
        "100",
        "10011"
      ],
      [
        "11",
        "11000"
      ],
      [
        "10",
        "1100000"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "1010",
        "1000"
      ],
      [
        "1010",
        "10110"
      ],
      [
        "110000",
        "11"
      ],
      [
        "1100011",
        "110"
      ],
      [
        "0",
        "110"
      ],
      [
        "100",
        "101100"
      ],
      [
        "100",
        "10000"
      ],
      [
        "1011",
        "110"
      ],
      [
        "11",
        "10000"
      ],
      [
        "10100",
        "1010"
      ],
      [
        "1011",
        "1000"
      ],
      [
        "100000",
        "11"
      ],
      [
        "1100000",
        "00"
      ],
      [
        "11000",
        "1100"
      ],
      [
        "1100011",
        "1000"
      ],
      [
        "1010110",
        "1"
      ],
      [
        "100",
        "101000"
      ],
      [
        "101100",
        "11"
      ],
      [
        "10110110",
        "1"
      ],
      [
        "1011",
        "100110"
      ],
      [
        "1100000",
        "11"
      ],
      [
        "10011",
        "110"
      ],
      [
        "1100",
        "10110"
      ],
      [
        "10000",
        "110"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "10011",
        "11"
      ],
      [
        "1010",
        "101"
      ],
      [
        "100",
        "100000"
      ]
    ]
  }
}